asgn4/README.tex
% Created 2016-04-04 Mon 22:01
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.75in]{geometry}
\author{Group 14}
\date{\today}
\title{Assignment 4 - CS335}
\hypersetup{
 pdfauthor={Group 14},
 pdftitle={Assignment 4 - CS335},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Build and Run}
\label{sec:orgheadline1}

\begin{itemize}
\item \texttt{cd asgn4}
\item \texttt{make}
\item \texttt{bin/irgen file}
\end{itemize}

\section{Features}
\label{sec:orgheadline2}

\begin{itemize}
\item \textbf{Declaration} : \texttt{val} and \texttt{var} declaration are supported. Also, It is necessary that declaration be accompanied by a value. It is optional to specify type. Multiple variables can be declared in same line.
\begin{verbatim}
val a = 5;
val b : Int = 27,  aldo = 21;
var c = 312;
\end{verbatim}

\item \textbf{Array} : Integer Arrays are Supported with predefined length. They can be used just like any other other variable with standard array referencing. 

\begin{verbatim}
val c = new Array[Int](21);
c[5] = a;
a = c[20]*2;
\end{verbatim}

\item \textbf{Objects} : There can be multiple singleton objects(Scala-Like). They cannot be referenced from each other. Also, code in outer most scope of both the objects will be executed(unlike scala, in which only the code of objects extending \texttt{App} are executed.)

\begin{verbatim}
object HelloWorld {

}
\end{verbatim}
\end{itemize}


\begin{itemize}
\item \textbf{For} : Nested For loops are implemented with new scope beginning at each loop. There are two variants \texttt{to} and \texttt{until} 
\begin{verbatim}
for ( i <- 23 to 71) {
    val j = 32;
    for ( j <- 21 until 23) a = a*2;
    print();
}
\end{verbatim}
\end{itemize}


\begin{itemize}
\item \textbf{While} : Nested While loops are implemented with new scope beginning at each loop. 

\begin{verbatim}
while(a >= 2) {
     print();
     a = a - 1;
     val b  = 32;
     while( b < 50) {
            b = b + 1 ;
       }
}
\end{verbatim}
\end{itemize}


\begin{itemize}
\item \textbf{If/Else} : Nested If/Else are implemented with new scope at each if, else.

\begin{verbatim}
if(a ==31) {
   print();
   if(b == 5) {
       print();
   }
}
else {
   a = 31;
}
\end{verbatim}
\end{itemize}


\begin{itemize}
\item \textbf{Case Switch} : Case/switch are supported and no new scope is made for them. We 
have not allowed fall-through and have clubbed all the conditional statements together for more efficient n-way
branch (due to cache-hits while fetching instructions)

\begin{verbatim}
2*c[20] + 1 match{
  case b * 2 => a = 2;
  case 7 => a = 3;
  case 2 => {a = 4; a = 6;}
}
\end{verbatim}
\end{itemize}


\begin{itemize}
\item \textbf{Functions} : Functions with multiple arguments and Single return value. A new scope is formed for each function.
Recursion is also suported.
\begin{verbatim}
 def print() = {
    val a = 2;
    print();
    return a;
}
\end{verbatim}
\end{itemize}
\end{document}